import re
import configSetting

with open(f"{configSetting.ROOT_PATH}/config/jieba/stop_words.txt", encoding="utf_8") as f:
    stop_words = [line.strip() for line in f.readlines()]

JIEBA_STOP_WORDS = stop_words

EFFECT_TOPIC_DICT = {
    "陳時中": "新冠疫情",
    "疫苗": "新冠疫情",
    "美國": "外交議題",
    "選舉": "政府施政",
    "中國": "兩岸關係",
    "高端": "新冠疫情",
    "日本": "外交議題",
    "防疫": "新冠疫情",
    "萊豬": "民生經濟",
    "大陸": "兩岸關係",
    "疫情": "新冠疫情",
    "中共": "兩岸關係",
    "網軍": "國防軍事",
    "能源": "民生經濟",
    "認知": "國防軍事",
    "缺電": "民生經濟",
    "核四": "民生經濟",
    "韓國": "外交議題",
    "發電": "民生經濟",
    "連署": "政府施政",
    "下架": "政府施政",
    "戰爭": "國防軍事",
    "兩岸": "兩岸關係",
    "核電": "民生經濟",
    "停電": "民生經濟",
    "確診": "新冠疫情",
    "抗中保台": "政府施政",
    "綠能": "民生經濟",
    "台電": "民生經濟",
    "競選": "政府施政",
    "民意": "政府施政",
    "大選": "政府施政",
    "電價": "民生經濟",
    "台獨": "兩岸關係",
    "快篩": "新冠疫情",
    "台積電": "民生經濟",
    "當選": "政府施政",
    "雞蛋": "民生經濟",
    "參選": "民生經濟",
    "獨立": "兩岸關係",
    "外交": "外交議題",
    "對岸": "兩岸關係",
    "香港": "兩岸關係",
    "改革": "政府施政",
    "烏克蘭": "外交議題",
    "美豬": "外交議題",
    "核能": "民生經濟",
    "顧食安": "民生經濟",
    "天然氣": "民生經濟",
    "豬肉": "民生經濟",
    "藻礁": "民生經濟",
    "教育": "政府施政",
    "提名": "政府施政",
    "斷交": "外交議題",
    "瘦肉精": "民生經濟",
    "外交部": "外交議題",
    "核廢料": "民生經濟",
    "同路人": "兩岸關係",
    "小英": "民生經濟",
    "國軍": "國防軍事",
    "裴洛西": "外交議題",
    "鳳梨": "民生經濟",
    "缺蛋": "民生經濟",
    "光電": "民生經濟",
    "國家隊": "民生經濟",
    "核電廠": "民生經濟",
    "輪替": "政府施政",
    "王美花": "民生經濟",
    "共產黨": "兩岸關係",
    "修法": "政府施政",
    "非核": "政府施政",
    "俄羅斯": "外交議題",
    "飛彈": "外交議題",
    "供電": "民生經濟",
    "柬埔寨": "外交議題",
    "台鐵": "民生經濟",
    "退選": "政府施政",
    "服貿": "兩岸關係",
    "電廠": "民生經濟",
    "缺水": "民生經濟",
    "打仗": "外交議題",
    "廢死": "政府施政",
    "藍白合": "政府施政",
    "核食": "外交議題",
}


EFFECT_TOPIC_SCORE_POINT = {
    "政府施政": 1,
    "外交議題": 8,
    "民生經濟": 2,
    "兩岸關係": 9,
    "改革議題": 3,
    "國防軍事": 7,
    "選舉議題": 6,
    "新冠疫情": 5,
    "資安議題": 4,
}

ACCOSIATE_DEPARTMENT_SCORE_POINT = {
    "內政部": 11,
    "外交部": 13,
    "國防部": 12,
    "教育部": 11,
    "法務部": 11,
    "財政部": 11,
    "經濟部": 11,
    "勞動部": 11,
    "文化部": 11,
    "農業部": 11,
    "衛福部": 11,
    "陸委會": 16,
    "交通部": 11,
    "中選會": 17,
    "海委會": 15,
    "地方政府": 14,
}

TAIWAN_CITY = {
    "台北": 1,
    "臺北": 1,
    "新北": 1,
    "桃園": 1,
    "台中": 1,
    "臺中": 1,
    "台南": 1,
    "臺南": 1,
    "高雄": 1,
    "新竹": 1,
    "苗栗": 1,
    "彰化": 1,
    "南投": 1,
    "雲林": 1,
    "嘉義": 1,
    "屏東": 1,
    "宜蘭": 1,
    "花蓮": 1,
    "台東": 1,
    "臺東": 1,
    "澎湖": 1,
    "金門": 1,
    "基隆": 1,
    "連江": 1,
}

SPECIAL_CHARS = (
    r"[!|#|~|,|。|，|？|！|：|;|；|』|『|」|「|“|、|”|】|【|／|\[|\]|?|*|※|］|［]"
)
URL_DETECT_REGEX = (
    r"http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\(\), ]|(?:%[0-9a-fA-F][0-9a-fA-F]))+"
)


EMOJI_PATTERN = re.compile(
    "["
    "\U0001F1E0-\U0001F1FF"  # flags (iOS)
    "\U0001F300-\U0001F5FF"  # symbols & pictographs
    "\U0001F600-\U0001F64F"  # emoticons
    "\U0001F680-\U0001F6FF"  # transport & map symbols
    "\U0001F700-\U0001F77F"  # alchemical symbols
    "\U0001F780-\U0001F7FF"  # Geometric Shapes Extended
    "\U0001F800-\U0001F8FF"  # Supplemental Arrows-C
    "\U0001F900-\U0001F9FF"  # Supplemental Symbols and Pictographs
    "\U0001FA00-\U0001FA6F"  # Chess Symbols
    "\U0001FA70-\U0001FAFF"  # Symbols and Pictographs Extended-A
    "\U00002702-\U000027B0"  # Dingbats
    "\u2640-\u2642"
    "\u200d"
    "\u23cf"
    "\u23e9"
    "\u231a"
    "\ufe0f"  # dingbats
    "\u3030"
    "]+",
    flags=re.UNICODE,
)
